Tekla Open API Reference for Tekla Structures 2025
Analysis.GetAnalysisObjectSelector Method
 Returns the analysis object selector.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObjectSelector GetAnalysisObjectSelector()
Public Function GetAnalysisObjectSelector As AnalysisObjectSelector
Return Value
Type: AnalysisObjectSelector
The analysis object selector on success.
See Also
Reference
Analysis Class
Tekla.Structures.Analysis Namespace